infrastructure/experiments/haproxy-old/source-3/ab_100_10.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.0.2 (be patient).....done


Server Software:        PIB
Server Hostname:        192.168.0.2
Server Port:            8080

Document Path:          /
Document Length:        2688 bytes

Concurrency Level:      10
Time taken for tests:   0.443 seconds
Complete requests:      100
Failed requests:        96
   (Connect: 0, Receive: 0, Length: 96, Exceptions: 0)
Total transferred:      288224 bytes
HTML transferred:       270024 bytes
Requests per second:    225.49 [#/sec] (mean)
Time per request:       44.349 [ms] (mean)
Time per request:       4.435 [ms] (mean, across all concurrent requests)
Transfer rate:          634.67 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    1   0.2      1       2
Processing:    16   40  17.1     39      97
Waiting:       16   40  17.1     39      97
Total:         17   41  17.2     40      98

Percentage of the requests served within a certain time (ms)
  50%     40
  66%     47
  75%     53
  80%     56
  90%     65
  95%     74
  98%     90
  99%     98
 100%     98 (longest request)
